In [18]:
import pandas as pd
import numpy as np

df = pd.read_csv("D:\\Data Quality Check\\Excel\\sample_peaks_300.csv")

df

   id          name  height      country
0   1       Everest    8975        India
1   2        Lhotse    7637  China/Nepal
2   3            K2    7221  India/Nepal
3   4  Nanga Parbat    8185  China/Nepal
4   5     Annapurna    7052     Pakistan

In [19]:
df.head(4)

   id          name  height      country
0   1       Everest    8975        India
1   2        Lhotse    7637  China/Nepal
2   3            K2    7221  India/Nepal
3   4  Nanga Parbat    8185  China/Nepal

In [20]:
rows,cols = df.shape

In [22]:
rows

300

In [23]:
df.columns

Index(['id', 'name', 'height', 'country'], dtype='object')

In [25]:
df.country

0            India
1      China/Nepal
2      India/Nepal
3      China/Nepal
4         Pakistan
          ...
295       Pakistan
296          China
297          China
298          Nepal
299       Pakistan
Name: country, Length: 300, dtype: object

In [26]:
df["country"]

0            India
1      China/Nepal
2      India/Nepal
3      China/Nepal
4         Pakistan
          ...
295       Pakistan
296          China
297          China
298          Nepal
299       Pakistan
Name: country, Length: 300, dtype: object

In [28]:
df[["country","name"]]

         country          name
0          India       Everest
1    China/Nepal        Lhotse
2    India/Nepal            K2
3    China/Nepal  Nanga Parbat
4       Pakistan     Annapurna
..           ...           ...
295     Pakistan        Lhotse
296        China    Dhaulagiri
297        China        Makalu
298        Nepal            K2
299     Pakistan        Makalu

[300 rows x 2 columns]

In [31]:
df[["height"]].max()

height    9000
dtype: int64

In [32]:
df[["height"]].min()

height    7005
dtype: int64

In [33]:
df.describe()

               id       height
count  300.000000   300.000000
mean   150.500000  7984.063333
std     86.746758   552.972478
min      1.000000  7005.000000
25%     75.750000  7526.000000
50%    150.500000  7979.000000
75%    225.250000  8436.750000
max    300.000000  9000.000000

In [48]:
df[["country","height"]][df["height"] >= 8960]

         country  height
0          India    8975
10      Pakistan    8962
51         Nepal    8967
63         Nepal    8977
176     Pakistan    9000
195  India/Nepal    8995
216        Nepal    8977
264        China    8966

In [49]:
df.index

RangeIndex(start=0, stop=300, step=1)